def add_log_name_and_desc(dict, log_id):
    """
    根据日志的编号，添加日志事件的名称和描述
    :param dict:
    :param log_id:
    :return:
    """
    # 事件编号与名称的对应
    name_dict = {
        4624: "成功登录事件",
        4625: "登录失败事件",
        4634: "注销事件",
        4647: "用户注销事件",
        4720: "创建用户事件",
        4722: "启用用户帐户事件",
        4723: "更改用户密码事件",
        4724: "创建安全组事件",
        4728: "成功授权事件",
        4738: "设置用户密码事件",
        1074: "计算机事件",
        6005: "服务启动事件",
        6006: "系统关闭事件",
        6008: "系统非正常关闭事件",
        6009: "系统重启事件",
        6013: "系统重启并更新",
        7036: "服务状态更改",
        7040: "启动或停止监视者通知",
        7045: "安装服务",
        1102: "日志清除"
    }

     # 事件编号与描述的对应
    desc_dict = {
        4624: "用户成功登录系统",
        4625: "用户尝试但未能成功登录系统",
        4634: "用户注销系统",
        4647: "用户通过重新启动或关闭计算机来注销系统",
        4720: "新用户帐户已创建",
        4722: "禁用的用户帐户已被启用",
        4723: "用户密码已更改",
        4724: "新安全组已创建",
        4728: "用户获得了指定对象的权限",
        4738: "用户密码已更改或重置",
        1074: "通过这个事件ID查看计算机的开机、关机、重启的时间以及原因和注释",
        6005: "表示计算机日志服务已启动，如果出现了事件ID为6005，则表示这天正常启动了系统",
        6006: "系统关闭",
        6008: "非正常关机",
        6009: "系统已经重新启动",
        6013: "系统已经重新启动，原因是操作系统版本升级",
        7036: "服务状态更改",
        7040: "启动或停止监视者通知",
        7045: "安装服务",
        1102: "有日志被清除"
    }

    dict['event_name'] = name_dict[log_id]
    dict['event_desc'] = desc_dict[log_id]

    return dict



